DataProcessors/РаботаСАктамиРасхождений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСАктамиРасхождений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерепоставленноеДарится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопоставкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяДопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачаНеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьСейчас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходоватьСейчас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуетсяСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуетсяСписаниеДопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуетсяОприходование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуетсяОприходованиеВозврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУменьшитьПереходПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУвеличитьПереходПраваСобственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыДействийПоТоварамВАктеПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПоТоварамВАктеПослеОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Списать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписатьИзПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходоватьВПуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчестьПриИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вернуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РаботаСАктамиРасхождений/Forms/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РасхожденияСервер.УправлениеСтраницамиВыборДействия(ЭтотОбъект, Параметры);
	
	ИспользоватьЗаявкиНаВозврат = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов");
	ИспользоватьЗаказыКлиентов = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	ИспользоватьЗаказыНаПеремещение = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение");
	ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5");
	КоличествоУпаковокРасхождения = Параметры.КоличествоУпаковокРасхождения;
	ГрупповоеИзменение = Параметры.ГрупповоеИзменение;
	ЭтоПереходПраваСобственности = (Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереходПраваСобственности);
	ЭтоРеализацияРеглУчет = (Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет);
	ТипАкта = Параметры.ТипАкта;
	ОтгрузкаПринципалу = Параметры.ОтгрузкаПринципалу;
	СпособОтраженияРасхождений = Параметры.СпособОтраженияРасхождений;
	СтрокаПоЗаказу = Параметры.СтрокаПоЗаказу;
	Договор = Параметры.Договор;
	ЕстьТара = Параметры.ЕстьТара;
	
	Если ОтгрузкаПринципалу
		Или Не ГрупповоеИзменение
			И КоличествоУпаковокРасхождения >= 0
			И (Параметры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа
				Или Параметры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Тогда
		Если ДействиеСДокументомИзлишки = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного Тогда
			ДействиеСДокументомИзлишки = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПустаяСсылка();
		КонецЕсли;
		Элементы.ВозвратПерепоставленного.Доступность = Ложь;
	КонецЕсли;
	
	Если Не ГрупповоеИзменение Тогда
		Если КоличествоУпаковокРасхождения >= 0 Тогда
			
			Элементы.Страницы.ТекущаяСтраница = Элементы.Излишки;
			
			ДействиеСТоваромИзлишки = ?(
				ЗначениеЗаполнено(Параметры.ВыбранноеДействиеСТоваром),
				Параметры.ВыбранноеДействиеСТоваром,
				Перечисления.ВариантыДействийПоТоварамВАктеПослеОтгрузки.УчестьПриИнвентаризации);
			
			ДействиеСДокументомИзлишки = ?(
				ЗначениеЗаполнено(Параметры.ВыбранноеДействиеСДокументом),
				Параметры.ВыбранноеДействиеСДокументом,
				Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного);
			
		Иначе
			
			Элементы.Страницы.ТекущаяСтраница = Элементы.Недостачи;
			
			ДействиеСТоваромНедостачи = ?(
				ЗначениеЗаполнено(Параметры.ВыбранноеДействиеСТоваром),
				Параметры.ВыбранноеДействиеСТоваром,
				Перечисления.ВариантыДействийПоТоварамВАктеПослеОтгрузки.УчестьПриИнвентаризации);
			
			ДействиеСДокументомНедостачи = ?(
				ЗначениеЗаполнено(Параметры.ВыбранноеДействиеСДокументом),
				Параметры.ВыбранноеДействиеСДокументом,
				Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется);
			
		КонецЕсли;
	Иначе
		
		Если Параметры.ЕстьИзлишки Тогда
			
			Если Не ЗначениеЗаполнено(ДействиеСТоваромИзлишки) Тогда
				ДействиеСТоваромИзлишки = Перечисления.ВариантыДействийПоТоварамВАктеПослеОтгрузки.УчестьПриИнвентаризации;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДействиеСДокументомИзлишки) Тогда
				ДействиеСДокументомИзлишки = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Параметры.ЕстьНедостачи Тогда
			
			Если Не ЗначениеЗаполнено(ДействиеСТоваромНедостачи) Тогда
				ДействиеСТоваромНедостачи = Перечисления.ВариантыДействийПоТоварамВАктеПослеОтгрузки.УчестьПриИнвентаризации;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДействиеСДокументомНедостачи) Тогда
				ДействиеСДокументомНедостачи = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ГрупповоеИзменение Тогда
		Заголовок = НСтр("ru='Как отработать расхождения'");
	Иначе
		Если КоличествоУпаковокРасхождения >= 0 Тогда
			Элементы.Недостачи.Видимость = Ложь;
			Заголовок = НСтр("ru='Как отработать излишек'");
		Иначе
			Элементы.Излишки.Видимость = Ложь;
			Заголовок = НСтр("ru='Как отработать недостачу'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КартинкаПояснения.Видимость = Параметры.ПоказыватьПояснение;
	Элементы.Пояснение.Видимость = Параметры.ПоказыватьПояснение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие И Модифицированность И НЕ ЗавершениеРаботы Тогда
		
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru='Выполненные изменения будут утеряны. Все равно закрыть?'"),
			РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьЗаголовки();
	УстановитьДоступностьДействий();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписатьДействиеСТоваромНедостачиПриИзменении(Элемент)
	
	Если РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		СформироватьЗаголовки();
	КонецЕсли;
	
	УстановитьДоступностьДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьИзПутиДействиеСТоваромНедостачиПриИзменении(Элемент)
	
	Если РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		СформироватьЗаголовки();
	КонецЕсли;
	
	УстановитьДоступностьДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура УчестьПриИнвентаризацииДействиеСТоваромНедостачиПриИзменении(Элемент)
	
	Если РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		СформироватьЗаголовки();
	КонецЕсли;
	
	УстановитьДоступностьДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьДействиеСТоваромНедостачиПриИзменении(Элемент)
	
	Если РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		СформироватьЗаголовки();
	КонецЕсли;
	
	УстановитьДоступностьДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьДействиеСТоваромНедостачиПриИзменении(Элемент)
	
	Если РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		СформироватьЗаголовки();
	КонецЕсли;
	
	УстановитьДоступностьДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура ОприходоватьВПутьДействиеСТоваромИзлишкиПриИзменении(Элемент)
	
	Если РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		СформироватьЗаголовки();
	КонецЕсли;
	
	УстановитьДоступностьДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура УчестьПриИнвентаризацииДействиеСТоваромИзлишкиПриИзменении(Элемент)
	УстановитьДоступностьДействий();
	
	Если РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		СформироватьЗаголовки();
	КонецЕсли;
	
	УстановитьДоступностьДействий();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыполняетсяЗакрытие = Истина;
	
	Если ГрупповоеИзменение Тогда
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("ДействиеСДокументомИзлишки", ДействиеСДокументомИзлишки);
		ПараметрыЗакрытия.Вставить("ДействиеСДокументомНедостачи", ДействиеСДокументомНедостачи);
		ПараметрыЗакрытия.Вставить("ДействиеСТоваромИзлишки", ДействиеСТоваромИзлишки);
		ПараметрыЗакрытия.Вставить("ДействиеСТоваромНедостачи", ДействиеСТоваромНедостачи);
		Закрыть(ПараметрыЗакрытия);
	ИначеЕсли КоличествоУпаковокРасхождения > 0 Тогда
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("ДействиеСДокументом", ДействиеСДокументомИзлишки);
		ПараметрыЗакрытия.Вставить("ДействиеСТоваром", ДействиеСТоваромИзлишки);
		Закрыть(ПараметрыЗакрытия);
	ИначеЕсли КоличествоУпаковокРасхождения < 0 Тогда
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("ДействиеСДокументом", ДействиеСДокументомНедостачи);
		ПараметрыЗакрытия.Вставить("ДействиеСТоваром", ДействиеСТоваромНедостачи);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть(Неопределено);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьЗаголовки()
	
	Если РасхожденияКлиентСервер.ТипОснованияРеализацияТоваровУслуг(ТипАкта) Тогда
		
		СформироватьЗаголовкиАктРеализация();
	
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровКлиенту(ТипАкта) Тогда
		
		СформироватьЗаголовкиАктОтгрузкаТоваровКлиенту();
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияВозвратПоставщику(ТипАкта) Тогда
		
		СформироватьЗаголовкиАктВозврат();
		
	ИначеЕсли ТипАкта = "Перемещение" Тогда
		
		СформироватьЗаголовкиАктПеремещение();
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПередачаТоваровХранителю(ТипАкта)
		Или РасхожденияКлиентСервер.ТипОснованияПередачаНаКомиссию(ТипАкта) Тогда
		
		СформироватьЗаголовкиАктПередача();
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровСХранения(ТипАкта) Тогда
		
		СформироватьЗаголовкиАктОтветственноеХранение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовкиАктРеализация()
	
	// 1. Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при реализации согласованы с клиентом'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при реализации не согласованы с клиентом'");
	
	// 1.1. Корректировка (исправление)
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		
		// Действие с товаром
		Элементы.СписатьИзПутиДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.СписатьИзПутиДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.ВернутьДействиеСТоваромНедостачи.Видимость =
			ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5 И ЗначениеЗаполнено(Договор) И Не ЕстьТара;
		Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Видимость =
			ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5 И ЗначениеЗаполнено(Договор) И Не ЕстьТара;
		
		Элементы.ОжидатьДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.ОжидатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.УчестьПриИнвентаризацииДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		
		Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Оформляется корректировка реализации для возврата товаров ""в путь""'");
		
		// Действие с документом
		
		// Оформить
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление)'");
		
		// Оформить и допоставить
		Если ЭтоПереходПраваСобственности Тогда
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара'");
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением реализации недопоставленного товара'");
		КонецЕсли;
		
	// 1.2. Корректировка (по согласованию сторон)
	ИначеЕсли СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию") Тогда
	
		// Действие с товаром
		Элементы.СписатьИзПутиДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.СписатьИзПутиДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.ВернутьДействиеСТоваромНедостачи.Видимость =
			ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5 И ЗначениеЗаполнено(Договор) И Не ЕстьТара;
		Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Видимость =
			ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5 И ЗначениеЗаполнено(Договор) И Не ЕстьТара;
		
		Элементы.ОжидатьДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.ОжидатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.УчестьПриИнвентаризацииДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		
		Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Оформляется корректировка реализации для возврата товаров ""в путь""'");
		
		// Действие с документом
		
		// Оформить
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон)'");
		
		// Оформить и допоставить
		Если ЭтоПереходПраваСобственности Тогда
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением отгрузки товаров клиенту недопоставленного товара'");
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением реализации недопоставленного товара'");
		КонецЕсли;
		
	// 1.3.
	ИначеЕсли СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы") Тогда
		
		// Действие с товаром
		Элементы.СписатьДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.СписатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.СписатьИзПутиДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.СписатьИзПутиДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.ВернутьДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.ОжидатьДействиеСТоваромНедостачи.Видимость = Ложь;
		Элементы.ОжидатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
		
		Элементы.УчестьПриИнвентаризацииДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		
		// Действия с документом
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (возврат недопоставленного товара)'");
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (возврат недопоставленного товара) с последующим оформлением реализации на допоставку'");
		
	// 1.4. Изменение документа
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Действие с товаром
		Элементы.СписатьДействиеСТоваромНедостачи.Видимость = Не ЭтоПереходПраваСобственности И Не ЭтоРеализацияРеглУчет;
		Элементы.СписатьДействиеСТоваромНедостачиДекорация.Видимость = Не ЭтоПереходПраваСобственности И Не ЭтоРеализацияРеглУчет;
		
		Элементы.СписатьИзПутиДействиеСТоваромНедостачи.Видимость = ЭтоПереходПраваСобственности;
		Элементы.СписатьИзПутиДействиеСТоваромНедостачиДекорация.Видимость = ЭтоПереходПраваСобственности;
		
		Элементы.ВернутьДействиеСТоваромНедостачи.Видимость = ЭтоПереходПраваСобственности;
		Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Видимость = ЭтоПереходПраваСобственности;
		
		Элементы.ОжидатьДействиеСТоваромНедостачи.Видимость = ЭтоПереходПраваСобственности;
		Элементы.ОжидатьДействиеСТоваромНедостачиДекорация.Видимость = ЭтоПереходПраваСобственности;
		
		Если ЭтоПереходПраваСобственности Тогда
			Элементы.УчестьПриИнвентаризацииДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту уменьшается на недопоставленный товар. Расхождения учитываются при инвентаризации'");
		Иначе
			Элементы.УчестьПриИнвентаризацииДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		КонецЕсли;
		
		Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Оформляется поступление товаров от клиента'");
		
		// Действие с документом
		
		// Оформить
		Если (СтрокаПоЗаказу Или ГрупповоеИзменение И ИспользоватьЗаказыКлиентов) И Не ЭтоПереходПраваСобственности Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа'");
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар'");
		КонецЕсли;
		
		// Оформить и допоставить
		Если ЭтоПереходПраваСобственности Тогда
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара'");
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар с последующим оформлением новой реализации недопоставленного товара'");
		КонецЕсли;
		
	КонецЕсли;
	
	// Допоставить без оформления
	Если ЭтоПереходПраваСобственности Тогда
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Неотгруженный товар отгружается со склада, документы не переоформляются'");
	Иначе
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются'");
	КонецЕсли;

	// Не признавать
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются'");
	
	// 2. Излишки
	
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при реализации согласованы с клиентом'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при реализации не согласованы с клиентом'");
	
	// 2.1.
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		
		// Действие с товаром
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишки.Видимость = Ложь;
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишкиДекорация.Видимость = Ложь;
		
		Элементы.УчестьПриИнвентаризацииДействиеСТоваромИзлишкиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		
		// Действие с документом
		
		// Оформить
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление)'");
		
		// Оформить и вернуть
		Если ЭтоПереходПраваСобственности Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением новой корректировки реализации на возврат перепоставленного товара ""в путь""'");
		Иначе
			
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением заявки на возврат перепоставленного товара'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением возврата перепоставленного товара'");
			КонецЕсли;
			
		КонецЕсли;
		
	// 2.2.
	ИначеЕсли СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию") Тогда
		
		// Действие с товаром
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишки.Видимость = Ложь;
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишкиДекорация.Видимость = Ложь;
		
		Элементы.УчестьПриИнвентаризацииДействиеСТоваромИзлишкиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		
		// Действие с документом
		
		// Оформить
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон)'");
		
		// Оформить и вернуть
		Если ЭтоПереходПраваСобственности Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением новой корректировки реализации на возврат перепоставленного товара ""в путь""'");
		Иначе
			
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением заявки на возврат перепоставленного товара'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением возврата перепоставленного товара'");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы") Тогда
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного)'");
		
		// Действие с товаром
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишки.Видимость = Ложь;
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишкиДекорация.Видимость = Ложь;
		
		Элементы.УчестьПриИнвентаризацииДействиеСТоваромИзлишкиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		
		// Действие с документом
		Если ИспользоватьЗаявкиНаВозврат Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного товара) с последующим оформлением заявки на возврат перепоставленного товара'");
		Иначе
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного товара) с последующим оформлением возврата перепоставленного товара'");
		КонецЕсли;
		
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Действие с товаром
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишки.Видимость = ЭтоПереходПраваСобственности;
		Элементы.ОприходоватьВПутьДействиеСТоваромИзлишкиДекорация.Видимость = ЭтоПереходПраваСобственности;
		
		Если ЭтоПереходПраваСобственности Тогда
			Элементы.УчестьПриИнвентаризацииДействиеСТоваромИзлишкиДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту увеличивается на недопоставленный товар. Расхождения учитываются при инвентаризации'");
		Иначе
			Элементы.УчестьПриИнвентаризацииДействиеСТоваромИзлишкиДекорация.Заголовок = НСтр("ru = 'Расхождения учитываются при инвентаризации'");
		КонецЕсли;
		
		// Действие с документом
		
		// Оформить
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар'");
		
		// Оформить и вернуть
		Если ЭтоПереходПраваСобственности Тогда
			
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличиваются на перепоставленный товар с последующим оформлением корректировки реализации на возврат перепоставленного товара ""в путь""'");
			
		Иначе
			
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар с последующим оформлением заявки на возврат перепоставленного товара'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар с последующим оформлением возврата перепоставленного товара'");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются'");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовкиАктОтгрузкаТоваровКлиенту()

	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при отгрузке согласованы с клиентом'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при отгрузке не согласованы с клиентом'");
	
	// Действие с товаром
	Элементы.СписатьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.СписатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Заголовок = НСтр("ru = 'Оформляется поступление товаров от клиента'");
	
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		
		// Действие с документом
		
		// Оформить
		Если ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.СписатьИзПути")
			Или ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.Вернуть") Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Исправление отгрузки товаров клиенту не оформляется'");
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется исправление отгрузки товаров клиенту с последующей отменой недопоставленных строк заказа'");
		КонецЕсли;
		
		// Оформить и допоставить
		Если ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.СписатьИзПути")
			Или ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.Вернуть") Тогда
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Оформляется новая отгрузка товаров клиенту на недопоставленный товар'");
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется исправление отгрузки товаров клиенту с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара'");
		КонецЕсли;
		
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Действие с документом
		
		// Оформить
		Если ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.СписатьИзПути")
			Или ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.Вернуть") Тогда
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту не изменяется'");
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа'");
		КонецЕсли;
		
		// Оформить и допоставить
		Если ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.СписатьИзПути")
			Или ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.Вернуть") Тогда
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Оформляется новая отгрузка товаров клиенту на недопоставленный товар'");
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту уменьшается на недопоставленный товар с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара'");
		КонецЕсли;
		
	КонецЕсли;
	
	// Допоставить без оформления
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются, реализация оформляется без учета расхождений'");
	
	// Не признавать
	Если Элементы.НедостачаНеПризнана.СписокВыбора.Количество() > 0 Тогда
		Элементы.НедостачаНеПризнана.СписокВыбора[0].Представление = НСтр("ru = 'Не признавать и не учитывать расхождения в реализации'");
	КонецЕсли;
	
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Расхождения не признаются, документы не переоформляются, реализация оформляется без учета расхождений'");
	
	// Излишки
	
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при отгрузке согласованы с клиентом'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при отгрузке не согласованы с клиентом'");
	
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		
		// Оформить
		Если ДействиеСТоваромИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.ОприходоватьВПуть") Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Исправление отгрузки товаров клиенту не оформляется'");
		Иначе
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется исправление отгрузки товаров клиенту'");
		КонецЕсли;
		
		// Оформить и вернуть
		Если ДействиеСТоваромИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.ОприходоватьВПуть") Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Оформляется поступление товаров от клиента для возврата перепоставленного товара'");
		Иначе
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется исправление отгрузки товаров клиенту с последующим оформлением поступления товаров от клиента для возврата перепоставленного товара'");
		КонецЕсли;
		
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Оформить
		Если ДействиеСТоваромИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.ОприходоватьВПуть") Тогда
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту не изменяется'");
		Иначе
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту увеличивается на перепоставленный товар'");
		КонецЕсли;
		
		// Оформить и вернуть
		Если ДействиеСТоваромИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.ОприходоватьВПуть") Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Оформляется поступление товаров от клиента для возврата перепоставленного товара'");
		Иначе
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту увеличивается на перепоставленный товар с последующим оформлением возврата перепоставленного товара'");
		КонецЕсли;
		
	КонецЕсли;
	
	// Вернуть без оформления
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются, реализация оформляется без учета расхождений'");

	// Не признавать
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");

	Если Элементы.ПерепоставленноеДарится.СписокВыбора.Количество() > 0 Тогда
		Элементы.ПерепоставленноеДарится.СписокВыбора[0].Представление = НСтр("ru = 'Не признавать и не учитывать расхождения в реализации'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовкиАктВозврат()
	
	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при возврате согласованы с поставщиком'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при возврате не согласованы с поставщиком'");
	
	// Действие с товаром
	Элементы.СписатьИзПутиДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.СписатьИзПутиДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.ВернутьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.ОжидатьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.ОжидатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	// Действие с документом
	Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику уменьшается на недопоставленный товар'");
	Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику уменьшается на недопоставленный товар с последующим оформлением нового возврата недопоставленного товара'");
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при возврате согласованы с поставщиком'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при возврате не согласованы с поставщиком'");
	
	// Действие с товаром
	Элементы.ОприходоватьВПутьДействиеСТоваромИзлишки.Видимость = Ложь;
	Элементы.ОприходоватьВПутьДействиеСТоваромИзлишкиДекорация.Видимость = Ложь;
	
	// Действие с документом
	Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику увеличивается на перепоставленный товар'");
	Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара'");
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются'");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовкиАктПеремещение()

	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при поступлении согласованы с отправителем'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при поступлении не согласованы с отправителем'");
	
	// Действия с товаром
	Элементы.ДекорацияНедостачиДействияСТоваром.Видимость = Ложь;
	Элементы.ГруппаНедостачиДействиеСТоваромКолонка.Видимость = Ложь;
	Элементы.ДекорацияНедостачиДействияСДокументом.Видимость = Ложь;
	
	Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыНаПеремещение) Тогда
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа'");
	Иначе
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар'");
	КонецЕсли;
	Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар с последующим оформлением нового перемещения недопоставленного товара'");
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада-отправителя, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада-отправителя, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при поступлении согласованы с отправителем'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при поступлении не согласованы с отправителем'");
	
	// Действия с товаром
	Элементы.ДекорацияИзлишкиДействияСТоваром.Видимость = Ложь;
	Элементы.ГруппаИзлишкиДействиеСТоваромКолонка.Видимость = Ложь;
	Элементы.ДекорацияИзлишкиДействияСДокументом.Видимость = Ложь;
	
	Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Перемещение товаров увеличивается на перепоставленный товар'");
	Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Перемещение товаров увеличивается на перепоставленный товар с последующим оформлением обратного перемещения перепоставленного товара'");
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад-отправитель, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад-отправитель, документы не переоформляются'");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовкиАктПередача()
	
	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при передаче согласованы с партнером'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при передаче не согласованы с партнером'");
	
	// Действие с товаром
	Элементы.СписатьИзПутиДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.СписатьИзПутиДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.ВернутьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.ОжидатьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.ОжидатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	// Действия с документом
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		
		Если СтрокаПоЗаказу
			Или (ГрупповоеИзменение
				И ИспользоватьЗаказыКлиентов) Тогда
			
			Если ТипАкта = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию") Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление) с последующей отменой недопоставленных строк заказа'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление) с последующей отменой недопоставленных строк заказа'");
			КонецЕсли;
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
			
		Иначе
			
			Если ТипАкта = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию") Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление)'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление)'");
			КонецЕсли;
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
			
		КонецЕсли;
		
		Если ТипАкта = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию") Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением новой передачи недопоставленного товара'");
		Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление) с последующим оформлением новой передачи недопоставленного товара'");
		КонецЕсли;
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = ТекстЗаголовка;
		
	Иначе
		
		Если СтрокаПоЗаказу
			Или (ГрупповоеИзменение
				И ИспользоватьЗаказыКлиентов) Тогда
			
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'Передача уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа'");
			
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'Передача уменьшается на недопоставленный товар'");
		КонецЕсли;
		
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок
			= НСтр("ru = 'Передача уменьшается на недопоставленный товар с последующим оформлением новой передачи недопоставленного товара'");
		
	КонецЕсли;
	
	Элементы.НедостачаНеПризнанаДекорация.Заголовок
		= НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок
		= НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при передаче согласованы с партнером'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при передаче не согласованы с партнером'");
	
	// Действие с товаром
	Элементы.ОприходоватьВПутьДействиеСТоваромИзлишки.Видимость = Ложь;
	Элементы.ОприходоватьВПутьДействиеСТоваромИзлишкиДекорация.Видимость = Ложь;
	
	// Действия с документом
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление)'");
		
		Если ИспользоватьЗаявкиНаВозврат
			Тогда
			Если ТипАкта = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию") Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением заявки на возврат перепоставленного товара'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением заявки на возврат перепоставленного товара'");
			КонецЕсли;
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
		Иначе
			Если ТипАкта = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию") Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением поступления перепоставленного товара'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением поступления перепоставленного товара'");
			КонецЕсли;
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением поступления перепоставленного товара'");
		КонецЕсли;
		
	Иначе
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Передача увеличивается на перепоставленный товар'");
		
		Если ИспользоватьЗаявкиНаВозврат
			Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Передача увеличивается на перепоставленный товар с последующим оформлением заявки на возврат перепоставленного товара'");
		Иначе
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Передача увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара'");
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок
		= НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок
		= НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются'");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовкиАктОтветственноеХранение()
	
	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при отгрузке с ответственного хранения согласованы с поставщиком'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при отгрузке с ответственного хранения не согласованы с поставщиком'");
	
	// Действие с товаром
	Элементы.СписатьИзПутиДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.СписатьИзПутиДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.СписатьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.СписатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.ВернутьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.ВернутьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	Элементы.ОжидатьДействиеСТоваромНедостачи.Видимость = Ложь;
	Элементы.ОжидатьДействиеСТоваромНедостачиДекорация.Видимость = Ложь;
	
	// Действие с документом
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		Если ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка принципалу (исправление)'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка поклажедателю (исправление)'");
		КонецЕсли;
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
		Если ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка принципалу (исправление) с последующим оформлением новой отгрузки недопоставленного товара'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка поклажедателю (исправление) с последующим оформлением новой отгрузки недопоставленного товара'");
		КонецЕсли;
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = ТекстЗаголовка;
	Иначе
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю уменьшается на недопоставленный товар'");
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю уменьшается на недопоставленный товар с последующим оформлением новой отгрузки недопоставленного товара'");
	КонецЕсли;
	
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при отгрузке с ответственного хранения согласованы с поставщиком'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при отгрузке с ответственного хранения не согласованы с поставщиком'");
	
	// Действие с товаром
	Элементы.ОприходоватьВПутьДействиеСТоваромИзлишки.Видимость = Ложь;
	Элементы.ОприходоватьВПутьДействиеСТоваромИзлишкиДекорация.Видимость = Ложь;
	
	// Действие с документом
	Если СпособОтраженияРасхождений = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов") Тогда
		Если ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка принципалу (исправление)'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка поклажедателю (исправление)'");
		КонецЕсли;
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
		Если ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка принципалу (исправление) с последующим оформлением поступления перепоставленного товара'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка поклажедателю (исправление) с последующим оформлением поступления перепоставленного товара'");
		КонецЕсли;
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
	Иначе
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю увеличивается на перепоставленный товар'");
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара'");
	КонецЕсли;
	
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются'");
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьДействий()
	
	// Недостачи
	
	Если ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.Списать") Тогда
		
		Элементы.ДопоставкаНеТребуется.Доступность = Истина;
		Элементы.ТребуетсяДопоставка.Доступность = Истина;
		Элементы.ОтгрузитьСейчас.Доступность = Истина;
		Элементы.НедостачаНеПризнана.Доступность = Ложь;
		
		Если ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана") Тогда
			ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется");
		КонецЕсли;
		
	ИначеЕсли ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.СписатьИзПути") Тогда
		
		Элементы.ДопоставкаНеТребуется.Доступность = Истина;
		Элементы.ТребуетсяДопоставка.Доступность = Истина;
		Элементы.ОтгрузитьСейчас.Доступность = Ложь;
		Элементы.НедостачаНеПризнана.Доступность = Ложь;
		
		Если ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана")
			Или ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОтгрузитьСейчас") Тогда
			ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется");
		КонецЕсли;
		
	ИначеЕсли ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.УчестьПриИнвентаризации") Тогда
		
		Элементы.ДопоставкаНеТребуется.Доступность = Истина;
		Элементы.ТребуетсяДопоставка.Доступность = Истина;
		Элементы.ОтгрузитьСейчас.Доступность = Истина;
		Элементы.НедостачаНеПризнана.Доступность = Истина;
		
	ИначеЕсли ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.Вернуть") Тогда
		
		Элементы.ДопоставкаНеТребуется.Доступность = Истина;
		Элементы.ТребуетсяДопоставка.Доступность = Истина;
		Элементы.ОтгрузитьСейчас.Доступность = Ложь;
		Элементы.НедостачаНеПризнана.Доступность = Ложь;
		
		Если ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана")
			Или ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОтгрузитьСейчас") Тогда
			ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется");
		КонецЕсли;
		
	ИначеЕсли ДействиеСТоваромНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.Ожидать") Тогда
		
		Элементы.ДопоставкаНеТребуется.Доступность = Ложь;
		Элементы.ТребуетсяДопоставка.Доступность = Ложь;
		Элементы.ОтгрузитьСейчас.Доступность = Ложь;
		Элементы.НедостачаНеПризнана.Доступность = Истина;
		
		Если ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется")
			Или ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка")
			Или ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОтгрузитьСейчас") Тогда
			ДействиеСДокументомНедостачи = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана");
		КонецЕсли;
		
	КонецЕсли;
	
	// Излишки
	
	Если ДействиеСТоваромИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.ОприходоватьВПуть") Тогда
		
		Элементы.ПокупкаПерепоставленного.Доступность = Истина;
		Элементы.ВозвратПерепоставленного.Доступность = Истина;
		Элементы.ОприходоватьСейчас.Доступность = Ложь;
		Элементы.ПерепоставленноеДарится.Доступность = Ложь;
		
		Если ДействиеСДокументомИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОприходоватьСейчас")
			Или ДействиеСДокументомИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПерепоставленноеДарится") Тогда
			ДействиеСДокументомИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного");
		КонецЕсли;
		
	ИначеЕсли ДействиеСТоваромИзлишки = ПредопределенноеЗначение("Перечисление.ВариантыДействийПоТоварамВАктеПослеОтгрузки.УчестьПриИнвентаризации") Тогда
		
		Элементы.ПокупкаПерепоставленного.Доступность = Истина;
		Элементы.ВозвратПерепоставленного.Доступность = Истина;
		Элементы.ОприходоватьСейчас.Доступность = Истина;
		Элементы.ПерепоставленноеДарится.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
